mikeysklar/esp-usbip-bridge/sdkconfig.defaults.p4hil
CONFIG_IDF_TARGET="esp32p4"
CONFIG_USBIP_BOARD_P4HIL_BOARD=y
CONFIG_USBIP_TRANSPORT_ETHERNET=y

# On P4, USB Serial/JTAG console does not conflict with USB host mode.
# CONFIG_ESP_CONSOLE_UART_DEFAULT is not set
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

CONFIG_USBIP_VIRTUAL_HARNESS=y
CONFIG_USBIP_VIRTUAL_LOGIC_ANALYZER=y

# P4Hil uses ESP32-P4 rev v1.0 (pre-ECO5)
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_ESP32P4_REV_MIN_FULL=100
CONFIG_ESP_REV_MIN_FULL=100
CONFIG_ESP32P4_REV_MAX_FULL=199
CONFIG_ESP_REV_MAX_FULL=199

# P4Hil Ethernet RMII pin mapping (from p4hil schematic)
CONFIG_USBIP_ETH_MDC_GPIO=53
CONFIG_USBIP_ETH_MDIO_GPIO=54
CONFIG_USBIP_ETH_PHY_ADDR=1
CONFIG_USBIP_ETH_PHY_RST_GPIO=52
CONFIG_USBIP_ETH_RMII_CLK_MODE=0
CONFIG_USBIP_ETH_RMII_CLK_GPIO=44
CONFIG_USBIP_ETH_RMII_TX_EN_GPIO=40
CONFIG_USBIP_ETH_RMII_TXD0_GPIO=41
CONFIG_USBIP_ETH_RMII_TXD1_GPIO=42
CONFIG_USBIP_ETH_RMII_CRS_DV_GPIO=45
CONFIG_USBIP_ETH_RMII_RXD0_GPIO=46
CONFIG_USBIP_ETH_RMII_RXD1_GPIO=47

# Neopixel on GPIO 27
CONFIG_USBIP_NEOPIXEL_GPIO=27

# ESP32-P4NRW32 has 32MB of in-package PSRAM. esp-perfetto-logic buffers
# captures there, so without this the logic analyzer falls back to a 16KB
# internal SRAM buffer and advertises 0 bytes of sample memory over SUMP.
CONFIG_SPIRAM=y
